---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainRootopening
source: html/0775f021-d383-5376-80c7-c205386e7990.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainRootopening Property

"Main Root Opening"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldMainRootopening { get; }
```